---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerKey.SubCategoryName
source: html/72d1407d-44a9-70c7-3b16-14efca9fe31a.htm
---
# Autodesk.Revit.DB.ExportLayerKey.SubCategoryName Property

The subcategrory Name.

## Syntax (C#)
```csharp
public string SubCategoryName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null